---
kind: other
id: Methods.T:Autodesk.Revit.DB.ExtensibleStorage.ExtensibleStorageFilter
source: html/e068eeea-777d-f3e6-0f8f-1ea5ae2e1142.htm
---
# ExtensibleStorageFilter Methods

Applies the filter to a given element.